#   -*- mode: org; fill-column: 60 -*-
#+STARTUP: showall
#+TITLE:   Warp & Woof Contents

[[https://img.shields.io/badge/made%20by-Chenla%20Institute-999999.svg?style=flat-square]] 
[[https://img.shields.io/badge/class-w & w-56B4E9.svg?style=flat-square]]
[[https://img.shields.io/badge/entity-TOC-0072B2.svg?style=flat-square]]
[[https://img.shields.io/badge/status-wip-D55E00.svg?style=flat-square]]
[[https://img.shields.io/badge/licence-MIT%2FCC%20BY--SA%204.0-000000.svg?style=flat-square]]

bibliography:../hoard/bib.bib

#+BEGIN_SRC sh :dir ~/proj/chenla/warp :results org drawer
  words=$(find ./ -type f -name '*.org' -exec wc -w {} \; | awk '{ sum += $1 } END { print sum }')
  pages=$(($words / 250))
  echo "|dir|words|pages"
  echo "|-"
  echo "|" ${PWD##*/} "|" $words  "|" $pages
  #+END_SRC

#+RESULTS:
:RESULTS:
| dir  |  words | pages |
|------+--------+-------|
| warp | 155551 |   622 |
:END:


[top]

